In [4]:
import pandas as pd

In [5]:
A=pd.Series()
print(A)     #note:-its create enmpty file

Series([], dtype: object)

In [6]:
#create series with single element
B=pd.Series("Hello")
print(B)

0    Hello
dtype: object

In [7]:
#create series using list
Colors=["blue","green","yelllow","red"]
series=pd.Series(Colors)
print(series)          #note:-[] square brackets using list

0       blue
1      green
2    yelllow
3        red
dtype: object

In [8]:
#create series using tuple
tuple=(1000,2000,3000,4000)
series=pd.Series(tuple)
print(series)            #note:-see the output 0123 these are all index numbers by deafault
                        #note:-tuple we are using parenthesis()

0    1000
1    2000
2    3000
3    4000
dtype: int64

In [9]:
#create series using dictionary
dict={101:"vishwa",102:"ram",103:"ravi",104:"basu"}
series=pd.Series(dict)
print(series)
                                #note:-here we give index values so it will print 101 102 like that
                                #note:-in dictionary we used curly braces{}

101    vishwa
102       ram
103      ravi
104      basu
dtype: object

In [10]:
A=pd.Series(["monday","tuesday","wednesday","thursday"])
print(A)    #note:-its default take index values

0       monday
1      tuesday
2    wednesday
3     thursday
dtype: object

In [11]:
#i want to change index values day1 and day2 like that
A.index=["day1","day2","day3","day4"]
print(A)

day1       monday
day2      tuesday
day3    wednesday
day4     thursday
dtype: object

In [12]:
A[0]

C:\Users\azt\AppData\Local\Temp\ipykernel_4472\303350297.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  A[0]

'monday'

In [13]:
A['day1']

'monday'

In [14]:
A[1:3]

day2      tuesday
day3    wednesday
dtype: object

**DataFrame**

In [15]:
#syntax
#pd.DataFrame(data,index,columns)

In [16]:
#create dataframe using nested list
list=[[1,2,3],[4,5,6],[7,8,9]]
A=pd.DataFrame(list)
A

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [17]:
data=[["vishwa",40],["ram",50],["ravi",60],["basu",20]]
A=pd.DataFrame(data,columns=["Name","Age"])
A                                                 #note:-we use  columns=["name","age"] get the name and age

     Name  Age
0  vishwa   40
1     ram   50
2    ravi   60
3    basu   20

In [18]:
#create dataframe using dictionary
dict={"Name":["vishwa","ram","ravi","chetan","laxman"],"Age":[45,34,23,45,35],"Job":["HR",",Manager","Analyst","Teacher","Engineer"],"Salary":
      [67000,84000,45000,53000,70000]}
data=pd.DataFrame(dict)
data

     Name  Age       Job  Salary
0  vishwa   45        HR   67000
1     ram   34  ,Manager   84000
2    ravi   23   Analyst   45000
3  chetan   45   Teacher   53000
4  laxman   35  Engineer   70000

In [19]:
list=[["apple",40],["mango",60,120],["orange",50]]
A=pd.DataFrame(list,columns=["fruits","no_of_fruits","price_per_kilo"])
A             #note:-see the output it will show the nan/null/none all three says missing values

   fruits  no_of_fruits  price_per_kilo
0   apple            40             NaN
1   mango            60           120.0
2  orange            50             NaN

In [20]:
#how to sort data
data

     Name  Age       Job  Salary
0  vishwa   45        HR   67000
1     ram   34  ,Manager   84000
2    ravi   23   Analyst   45000
3  chetan   45   Teacher   53000
4  laxman   35  Engineer   70000

In [21]:
data.sort_values("Salary") #ascending order

     Name  Age       Job  Salary
2    ravi   23   Analyst   45000
3  chetan   45   Teacher   53000
0  vishwa   45        HR   67000
4  laxman   35  Engineer   70000
1     ram   34  ,Manager   84000

In [22]:
 data.sort_values("Salary",ascending=False)

     Name  Age       Job  Salary
1     ram   34  ,Manager   84000
4  laxman   35  Engineer   70000
0  vishwa   45        HR   67000
3  chetan   45   Teacher   53000
2    ravi   23   Analyst   45000

In [23]:
#to sort in ascending----- by default it sorts in  ascending or else just give ascending=True
#to sort in descending----give ascending=False
#to make peremenent change---- inplacce=True

In [24]:
#how to create copy of data
data1=data.copy()
data1

     Name  Age       Job  Salary
0  vishwa   45        HR   67000
1     ram   34  ,Manager   84000
2    ravi   23   Analyst   45000
3  chetan   45   Teacher   53000
4  laxman   35  Engineer   70000

In [25]:
 data.sort_values("Age",inplace=True)
data

     Name  Age       Job  Salary
2    ravi   23   Analyst   45000
1     ram   34  ,Manager   84000
4  laxman   35  Engineer   70000
0  vishwa   45        HR   67000
3  chetan   45   Teacher   53000

**how to fetch columns and  rows**

In [26]:
#loc :loc function is used  to r=fetch columns and rows based on colum  name or index name
#iloc :iloc function used to fetch rows and columns  based on index position of rows and columns.

In [27]:
data

     Name  Age       Job  Salary
2    ravi   23   Analyst   45000
1     ram   34  ,Manager   84000
4  laxman   35  Engineer   70000
0  vishwa   45        HR   67000
3  chetan   45   Teacher   53000

In [28]:
#fetch name column
data[["Name"]]

     Name
2    ravi
1     ram
4  laxman
0  vishwa
3  chetan

In [29]:
#fetch age and salary
data[["Age","Salary"]]

   Age  Salary
2   23   45000
1   34   84000
4   35   70000
0   45   67000
3   45   53000

In [30]:
#fetch name and colum using loc
data.loc[:,['Name']]

     Name
2    ravi
1     ram
4  laxman
0  vishwa
3  chetan

In [31]:
#fetch Age column using loc
data.loc[:,['Age']]

   Age
2   23
1   34
4   35
0   45
3   45

In [32]:
data.loc[:,['Age','Salary']]

   Age  Salary
2   23   45000
1   34   84000
4   35   70000
0   45   67000
3   45   53000

In [33]:
#fetch first row
data.loc[[2],:]

   Name  Age      Job  Salary
2  ravi   23  Analyst   45000

In [34]:
#fetch second and third row
data.loc[[1,4],:]

     Name  Age       Job  Salary
1     ram   34  ,Manager   84000
4  laxman   35  Engineer   70000

In [35]:
#fetch first and last row
data.loc[[2,3],:]

     Name  Age      Job  Salary
2    ravi   23  Analyst   45000
3  chetan   45  Teacher   53000

In [36]:
data=pd.DataFrame(dict)
data            #note:-just i want change for the old data beacuse of knowledge purpose

     Name  Age       Job  Salary
0  vishwa   45        HR   67000
1     ram   34  ,Manager   84000
2    ravi   23   Analyst   45000
3  chetan   45   Teacher   53000
4  laxman   35  Engineer   70000

In [37]:
#fetch first and last row
data.loc[[0,4],:]

     Name  Age       Job  Salary
0  vishwa   45        HR   67000
4  laxman   35  Engineer   70000

In [38]:
#fetch second,third,fourth and fifth row
data.loc[[1,2,3,4],:]

     Name  Age       Job  Salary
1     ram   34  ,Manager   84000
2    ravi   23   Analyst   45000
3  chetan   45   Teacher   53000
4  laxman   35  Engineer   70000

In [39]:
data.loc[1:6,:]    #note :-it is also same

     Name  Age       Job  Salary
1     ram   34  ,Manager   84000
2    ravi   23   Analyst   45000
3  chetan   45   Teacher   53000
4  laxman   35  Engineer   70000

In [43]:
#fetch 1 to 4 rows and three columns
data.loc[[1,2,3,4],["Age","Job","Salary"]]

   Age       Job  Salary
1   34  ,Manager   84000
2   23   Analyst   45000
3   45   Teacher   53000
4   35  Engineer   70000

In [44]:
data.loc[[0,2,4],["Job","Salary"]]

        Job  Salary
0        HR   67000
2   Analyst   45000
4  Engineer   70000

In [45]:
data.loc[1:5,"Age":"Salary"]

   Age       Job  Salary
1   34  ,Manager   84000
2   23   Analyst   45000
3   45   Teacher   53000
4   35  Engineer   70000

**iloc**

In [46]:
data

     Name  Age       Job  Salary
0  vishwa   45        HR   67000
1     ram   34  ,Manager   84000
2    ravi   23   Analyst   45000
3  chetan   45   Teacher   53000
4  laxman   35  Engineer   70000

In [47]:
#fetch first row
data.iloc[:,[0]]

     Name
0  vishwa
1     ram
2    ravi
3  chetan
4  laxman

In [48]:
#fetch  third and fourth row
data.iloc[:,[2,3]]

        Job  Salary
0        HR   67000
1  ,Manager   84000
2   Analyst   45000
3   Teacher   53000
4  Engineer   70000

In [49]:
#fetch first row
data.iloc[[0],:]

     Name  Age Job  Salary
0  vishwa   45  HR   67000

In [50]:
data

     Name  Age       Job  Salary
0  vishwa   45        HR   67000
1     ram   34  ,Manager   84000
2    ravi   23   Analyst   45000
3  chetan   45   Teacher   53000
4  laxman   35  Engineer   70000

In [51]:
#fetch second and third row using iloc
data.iloc[[1,2],:]

   Name  Age       Job  Salary
1   ram   34  ,Manager   84000
2  ravi   23   Analyst   45000

In [53]:
data.iloc[1:3,0:3] #note:-here we hav eto use that slicing(:)

   Name  Age       Job
1   ram   34  ,Manager
2  ravi   23   Analyst